In [131]:
import numpy as np
import pandas as pd

In [132]:
print(dir(pd))
	
animal = ["tiger", "bear", "eagle", "lion"]
print(pd.Series(animal))

['BooleanDtype', 'Categorical', 'CategoricalDtype', 'CategoricalIndex', 'DataFrame', 'DateOffset', 'DatetimeIndex', 'DatetimeTZDtype', 'ExcelFile', 'ExcelWriter', 'Flags', 'Float32Dtype', 'Float64Dtype', 'Float64Index', 'Grouper', 'HDFStore', 'Index', 'IndexSlice', 'Int16Dtype', 'Int32Dtype', 'Int64Dtype', 'Int64Index', 'Int8Dtype', 'Interval', 'IntervalDtype', 'IntervalIndex', 'MultiIndex', 'NA', 'NaT', 'NamedAgg', 'Period', 'PeriodDtype', 'PeriodIndex', 'RangeIndex', 'Series', 'SparseDtype', 'StringDtype', 'Timedelta', 'TimedeltaIndex', 'Timestamp', 'UInt16Dtype', 'UInt32Dtype', 'UInt64Dtype', 'UInt64Index', 'UInt8Dtype', '__builtins__', '__cached__', '__doc__', '__docformat__', '__file__', '__getattr__', '__git_version__', '__loader__', '__name__', '__package__', '__path__', '__spec__', '__version__', '_config', '_hashtable', '_is_numpy_dev', '_lib', '_libs', '_np_version_under1p18', '_testing', '_tslib', '_typing', '_version', 'api', 'array', 'arrays', 'bdate_range', 'compat', 'concat', 'core', 'crosstab', 'cut', 'date_range', 'describe_option', 'errors', 'eval', 'factorize', 'get_dummies', 'get_option', 'infer_freq', 'interval_range', 'io', 'isna', 'isnull', 'json_normalize', 'lreshape', 'melt', 'merge', 'merge_asof', 'merge_ordered', 'notna', 'notnull', 'offsets', 'option_context', 'options', 'pandas', 'period_range', 'pivot', 'pivot_table', 'plotting', 'qcut', 'read_clipboard', 'read_csv', 'read_excel', 'read_feather', 'read_fwf', 'read_gbq', 'read_hdf', 'read_html', 'read_json', 'read_orc', 'read_parquet', 'read_pickle', 'read_sas', 'read_spss', 'read_sql', 'read_sql_query', 'read_sql_table', 'read_stata', 'read_table', 'read_xml', 'reset_option', 'set_eng_float_format', 'set_option', 'show_versions', 'test', 'testing', 'timedelta_range', 'to_datetime', 'to_numeric', 'to_pickle', 'to_timedelta', 'tseries', 'unique', 'util', 'value_counts', 'wide_to_long']
0    tiger
1     bear
2    eagle
3     lion
dtype: object

In [133]:
numbers = [1, 2,3,4,5,6, None]
print(pd.Series(numbers))

# NaN is used as a marker for missing data instead of None for computational speed and convenience

capitals = {"Korea" : "Seoul", "Japan": "Tokyo", "China":"Beijing", "USA":"DC"}

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
6    NaN
dtype: float64

In [134]:


s = pd.Series(capitals)


print(s.index)


print(s.values)

Index(['Korea', 'Japan', 'China', 'USA'], dtype='object')
['Seoul' 'Tokyo' 'Beijing' 'DC']

In [135]:

countries = ["Austria", "Belgium", "Canada", "Cuba"]

cities = ["Vienna", "Brussels", "Ottawa", "ABNA"]

t = pd.Series(cities, index = countries)

In [136]:
print(t)


print(t.loc["Austria"])
print(t.iloc[0])

Austria      Vienna
Belgium    Brussels
Canada       Ottawa
Cuba           ABNA
dtype: object
Vienna
Vienna

In [137]:
v = pd.Series([1,2,3,4,5,6], index=[0,1,2,3,4,5])


print(v)
print(v[0])


total = 0
for i in range(6):
	total+= v[i]

print(total)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64
1
21

In [138]:
v = pd.Series([1,2,3,4,5,6], index=[0,1,2,3,4,5])


print(v)
print(v[0])
total = 0
for i in range(6):
	total+= v[i]

print(total)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64
1
21

In [139]:
w = pd.Series(np.random.randint(0,1000,10000)) # this creates a big Series of random integer 
print(w)
	
print(w.head())

print()
print(w.tail())

0       480
1       217
2       629
3       816
4       555
       ...
9995     84
9996    393
9997    589
9998    594
9999    548
Length: 10000, dtype: int64
0    480
1    217
2    629
3    816
4    555
dtype: int64

9995     84
9996    393
9997    589
9998    594
9999    548
dtype: int64

In [140]:
%%timeit -n 100
total = 0 
for item in w:
    total += item

# print(total)

617 µs ± 22.8 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [141]:
%%timeit -n 100
total = np.sum(w)

22.3 µs ± 3.06 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [142]:
print(w.head())

0    480
1    217
2    629
3    816
4    555
dtype: int64

In [143]:
for label, value in w.iteritems():
    w[label] += 10

print(w.head())

0    490
1    227
2    639
3    826
4    565
dtype: int64

In [144]:
%%timeit -n 10
for label, value in w.iteritems():
    w[label] = value + 10

19 ms ± 253 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [145]:
%%timeit -n 10
w = pd.Series(np.random.randint(0,1000,10000))
w += 10

94.1 µs ± 21.1 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [146]:
print(s)

Korea      Seoul
Japan      Tokyo
China    Beijing
USA           DC
dtype: object

In [147]:
s["Egypt"] = "Kairo"

In [148]:
print(t)

Austria      Vienna
Belgium    Brussels
Canada       Ottawa
Cuba           ABNA
dtype: object

In [149]:
s = s.append(t)

In [150]:
print(s)

Korea         Seoul
Japan         Tokyo
China       Beijing
USA              DC
Egypt         Kairo
Austria      Vienna
Belgium    Brussels
Canada       Ottawa
Cuba           ABNA
dtype: object

In [151]:
print(s.drop("USA"))

Korea         Seoul
Japan         Tokyo
China       Beijing
Egypt         Kairo
Austria      Vienna
Belgium    Brussels
Canada       Ottawa
Cuba           ABNA
dtype: object

In [152]:
print(s)

Korea         Seoul
Japan         Tokyo
China       Beijing
USA              DC
Egypt         Kairo
Austria      Vienna
Belgium    Brussels
Canada       Ottawa
Cuba           ABNA
dtype: object

In [153]:
x = pd.Series(s, index=["Korea", "Canada","Egypt", "Mexico" ])
x

Korea      Seoul
Canada    Ottawa
Egypt      Kairo
Mexico       NaN
dtype: object

In [154]:
# DataFrame
# Creating DataFrame

In [155]:
punchase_1 = pd.Series({"name" : 'David', "item Purchase" : "TV", "Cost" : 1000})
punchase_2 = pd.Series({"name" : 'Jane', "item Purchase" : "Laptop", "Cost" : 1500})
punchase_3 = pd.Series({"name" : 'Kevin', "item Purchase" : "Car", "Cost" : 20000})

In [156]:
df = pd.DataFrame([punchase_1, punchase_2, punchase_3], index=['Store 1', 'Store 2', 'Store 3'])
print(df)

          name item Purchase   Cost
Store 1  David            TV   1000
Store 2   Jane        Laptop   1500
Store 3  Kevin           Car  20000

In [157]:
print(df.loc['Store 1'])

name             David
item Purchase       TV
Cost              1000
Name: Store 1, dtype: object

In [158]:
print(df.loc['Store 1']['Cost'])

1000

In [159]:
print(df['Cost'])

Store 1     1000
Store 2     1500
Store 3    20000
Name: Cost, dtype: int64

In [160]:
data = {'name':['John', 'Jane', 'Tom', 'Rick', 'Sara'], 
        'year':[2013, 2017, 2015, 2016, 2015],
        'points':[2.5, 3.2, 2.4, 7.1, 1.1]}

In [161]:
print(data)

{'name': ['John', 'Jane', 'Tom', 'Rick', 'Sara'], 'year': [2013, 2017, 2015, 2016, 2015], 'points': [2.5, 3.2, 2.4, 7.1, 1.1]}

In [162]:
print(type(data))

<class 'dict'>

In [163]:
df = pd.DataFrame(data)

In [164]:
print(df)

   name  year  points
0  John  2013     2.5
1  Jane  2017     3.2
2   Tom  2015     2.4
3  Rick  2016     7.1
4  Sara  2015     1.1

In [165]:
df2 = pd.DataFrame(data,
                   columns=['year', 'name', 'points','penalty'], 
                   index = ['one', 'two','three', 'four', 'five'])

In [166]:
print(df2)

       year  name  points penalty
one    2013  John     2.5     NaN
two    2017  Jane     3.2     NaN
three  2015   Tom     2.4     NaN
four   2016  Rick     7.1     NaN
five   2015  Sara     1.1     NaN

In [167]:
df2['year']

one      2013
two      2017
three    2015
four     2016
five     2015
Name: year, dtype: int64

In [168]:
df2.year

one      2013
two      2017
three    2015
four     2016
five     2015
Name: year, dtype: int64

In [169]:
df2[['year','points']]

       year  points
one    2013     2.5
two    2017     3.2
three  2015     2.4
four   2016     7.1
five   2015     1.1

In [170]:
df2['penalty'] = 0.5

In [171]:
print(df2)

       year  name  points  penalty
one    2013  John     2.5      0.5
two    2017  Jane     3.2      0.5
three  2015   Tom     2.4      0.5
four   2016  Rick     7.1      0.5
five   2015  Sara     1.1      0.5

In [172]:
val1 = pd.Series([-1.3, -2.2, -0.9], index = ['two','four', 'five'])

In [173]:
df2['debt'] = val1

In [174]:
df2['net_points'] = df2['points'] - df2['penalty']

In [175]:
df2

       year  name  points  penalty  debt  net_points
one    2013  John     2.5      0.5   NaN         2.0
two    2017  Jane     3.2      0.5  -1.3         2.7
three  2015   Tom     2.4      0.5   NaN         1.9
four   2016  Rick     7.1      0.5  -2.2         6.6
five   2015  Sara     1.1      0.5  -0.9         0.6

In [176]:
df2['high_points'] = df2['points'] > 2.0

In [177]:
print(df2)

       year  name  points  penalty  debt  net_points  high_points
one    2013  John     2.5      0.5   NaN         2.0         True
two    2017  Jane     3.2      0.5  -1.3         2.7         True
three  2015   Tom     2.4      0.5   NaN         1.9         True
four   2016  Rick     7.1      0.5  -2.2         6.6         True
five   2015  Sara     1.1      0.5  -0.9         0.6        False

In [178]:
df2.drop('one')

       year  name  points  penalty  debt  net_points  high_points
two    2017  Jane     3.2      0.5  -1.3         2.7         True
three  2015   Tom     2.4      0.5   NaN         1.9         True
four   2016  Rick     7.1      0.5  -2.2         6.6         True
five   2015  Sara     1.1      0.5  -0.9         0.6        False

In [179]:
print(df2)

       year  name  points  penalty  debt  net_points  high_points
one    2013  John     2.5      0.5   NaN         2.0         True
two    2017  Jane     3.2      0.5  -1.3         2.7         True
three  2015   Tom     2.4      0.5   NaN         1.9         True
four   2016  Rick     7.1      0.5  -2.2         6.6         True
five   2015  Sara     1.1      0.5  -0.9         0.6        False

In [181]:
df2.drop('debt', axis = 1)

       year  name  points  penalty  net_points  high_points
one    2013  John     2.5      0.5         2.0         True
two    2017  Jane     3.2      0.5         2.7         True
three  2015   Tom     2.4      0.5         1.9         True
four   2016  Rick     7.1      0.5         6.6         True
five   2015  Sara     1.1      0.5         0.6        False

In [182]:
df2.drop(columns = 'debt')

       year  name  points  penalty  net_points  high_points
one    2013  John     2.5      0.5         2.0         True
two    2017  Jane     3.2      0.5         2.7         True
three  2015   Tom     2.4      0.5         1.9         True
four   2016  Rick     7.1      0.5         6.6         True
five   2015  Sara     1.1      0.5         0.6        False

In [183]:
df2

       year  name  points  penalty  debt  net_points  high_points
one    2013  John     2.5      0.5   NaN         2.0         True
two    2017  Jane     3.2      0.5  -1.3         2.7         True
three  2015   Tom     2.4      0.5   NaN         1.9         True
four   2016  Rick     7.1      0.5  -2.2         6.6         True
five   2015  Sara     1.1      0.5  -0.9         0.6        False

In [184]:
df2.T

              one   two three  four   five
year         2013  2017  2015  2016   2015
name         John  Jane   Tom  Rick   Sara
points        2.5   3.2   2.4   7.1    1.1
penalty       0.5   0.5   0.5   0.5    0.5
debt          NaN  -1.3   NaN  -2.2   -0.9
net_points    2.0   2.7   1.9   6.6    0.6
high_points  True  True  True  True  False

In [185]:
df2.T['one']

year           2013
name           John
points          2.5
penalty         0.5
debt            NaN
net_points      2.0
high_points    True
Name: one, dtype: object

In [186]:
df2.T.loc['name']

one      John
two      Jane
three     Tom
four     Rick
five     Sara
Name: name, dtype: object

In [187]:
# row operation

In [189]:
df2[0:3]

       year  name  points  penalty  debt  net_points  high_points
one    2013  John     2.5      0.5   NaN         2.0         True
two    2017  Jane     3.2      0.5  -1.3         2.7         True
three  2015   Tom     2.4      0.5   NaN         1.9         True

In [190]:
df2.loc['one':'three']

       year  name  points  penalty  debt  net_points  high_points
one    2013  John     2.5      0.5   NaN         2.0         True
two    2017  Jane     3.2      0.5  -1.3         2.7         True
three  2015   Tom     2.4      0.5   NaN         1.9         True

In [191]:
df2.loc['two']

year           2017
name           Jane
points          3.2
penalty         0.5
debt           -1.3
net_points      2.7
high_points    True
Name: two, dtype: object

In [202]:
df2.loc[:,'year']

one      2013
two      2017
three    2015
four     2016
five     2015
Name: year, dtype: int64

In [203]:
df2.loc['one':'three', ['year', 'points']]

       year  points
one    2013     2.5
two    2017     3.2
three  2015     2.4

In [204]:
df2.loc['one':'three', 'year':'points']

       year  name  points
one    2013  John     2.5
two    2017  Jane     3.2
three  2015   Tom     2.4

In [207]:
df2.iloc[0]

year           2013
name           John
points          2.5
penalty         0.5
debt            NaN
net_points      2.0
high_points    True
Name: one, dtype: object

In [209]:
df2.iloc[:,0]

one      2013
two      2017
three    2015
four     2016
five     2015
Name: year, dtype: int64

In [213]:
df2.iloc[2:4:1,1:5:2]

       name  penalty
three   Tom      0.5
four   Rick      0.5

In [214]:
df2.iloc[[0,1,3],[2,4,]]

      points  debt
one      2.5   NaN
two      3.2  -1.3
four     7.1  -2.2

In [215]:
# boolean indexing

In [216]:
df2['year'] > 2015

one      False
two       True
three    False
four      True
five     False
Name: year, dtype: bool

In [217]:
df2[df2['year'] > 2015]

      year  name  points  penalty  debt  net_points  high_points
two   2017  Jane     3.2      0.5  -1.3         2.7         True
four  2016  Rick     7.1      0.5  -2.2         6.6         True

In [219]:
df2.loc[df2['year'] > 2015, 'name':'penalty']

      name  points  penalty
two   Jane     3.2      0.5
four  Rick     7.1      0.5

In [221]:
df2.loc[(df2['year']>2013) & df2['high_points']]

       year  name  points  penalty  debt  net_points  high_points
two    2017  Jane     3.2      0.5  -1.3         2.7         True
three  2015   Tom     2.4      0.5   NaN         1.9         True
four   2016  Rick     7.1      0.5  -2.2         6.6         True

In [222]:
df2.size

35

In [223]:
df2.ndim

2

In [225]:
print(help(df2.ndim))

Help on int object:

class int(object)
 |  int([x]) -> integer
 |  int(x, base=10) -> integer
 |
 |  Convert a number or string to an integer, or return 0 if no arguments
 |  are given.  If x is a number, return x.__int__().  For floating point
 |  numbers, this truncates towards zero.
 |
 |  If x is not a number or if base is given, then x must be a string,
 |  bytes, or bytearray instance representing an integer literal in the
 |  given base.  The literal can be preceded by '+' or '-' and be surrounded
 |  by whitespace.  The base defaults to 10.  Valid bases are 0 and 2-36.
 |  Base 0 means to interpret the base from the string as an integer literal.
 |  >>> int('0b100', base=0)
 |  4
 |
 |  Built-in subclasses:
 |      bool
 |
 |  Methods defined here:
 |
 |  __abs__(self, /)
 |      abs(self)
 |
 |  __add__(self, value, /)
 |      Return self+value.
 |
 |  __and__(self, value, /)
 |      Return self&value.
 |
 |  __bool__(self, /)
 |      self != 0
 |
 |  __ceil__(...)
 |      Ceiling of an Integral returns itself.
 |
 |  __divmod__(self, value, /)
 |      Return divmod(self, value).
 |
 |  __eq__(self, value, /)
 |      Return self==value.
 |
 |  __float__(self, /)
 |      float(self)
 |
 |  __floor__(...)
 |      Flooring an Integral returns itself.
 |
 |  __floordiv__(self, value, /)
 |      Return self//value.
 |
 |  __format__(self, format_spec, /)
 |      Default object formatter.
 |
 |  __ge__(self, value, /)
 |      Return self>=value.
 |
 |  __getattribute__(self, name, /)
 |      Return getattr(self, name).
 |
 |  __getnewargs__(self, /)
 |
 |  __gt__(self, value, /)
 |      Return self>value.
 |
 |  __hash__(self, /)
 |      Return hash(self).
 |
 |  __index__(self, /)
 |      Return self converted to an integer, if self is suitable for use as an index into a list.
 |
 |  __int__(self, /)
 |      int(self)
 |
 |  __invert__(self, /)
 |      ~self
 |
 |  __le__(self, value, /)
 |      Return self<=value.
 |
 |  __lshift__(self, value, /)
 |      Return self<<value.
 |
 |  __lt__(self, value, /)
 |      Return self<value.
 |
 |  __mod__(self, value, /)
 |      Return self%value.
 |
 |  __mul__(self, value, /)
 |      Return self*value.
 |
 |  __ne__(self, value, /)
 |      Return self!=value.
 |
 |  __neg__(self, /)
 |      -self
 |
 |  __or__(self, value, /)
 |      Return self|value.
 |
 |  __pos__(self, /)
 |      +self
 |
 |  __pow__(self, value, mod=None, /)
 |      Return pow(self, value, mod).
 |
 |  __radd__(self, value, /)
 |      Return value+self.
 |
 |  __rand__(self, value, /)
 |      Return value&self.
 |
 |  __rdivmod__(self, value, /)
 |      Return divmod(value, self).
 |
 |  __repr__(self, /)
 |      Return repr(self).
 |
 |  __rfloordiv__(self, value, /)
 |      Return value//self.
 |
 |  __rlshift__(self, value, /)
 |      Return value<<self.
 |
 |  __rmod__(self, value, /)
 |      Return value%self.
 |
 |  __rmul__(self, value, /)
 |      Return value*self.
 |
 |  __ror__(self, value, /)
 |      Return value|self.
 |
 |  __round__(...)
 |      Rounding an Integral returns itself.
 |      Rounding with an ndigits argument also returns an integer.
 |
 |  __rpow__(self, value, mod=None, /)
 |      Return pow(value, self, mod).
 |
 |  __rrshift__(self, value, /)
 |      Return value>>self.
 |
 |  __rshift__(self, value, /)
 |      Return self>>value.
 |
 |  __rsub__(self, value, /)
 |      Return value-self.
 |
 |  __rtruediv__(self, value, /)
 |      Return value/self.
 |
 |  __rxor__(self, value, /)
 |      Return value^self.
 |
 |  __sizeof__(self, /)
 |      Returns size in memory, in bytes.
 |
 |  __sub__(self, value, /)
 |      Return self-value.
 |
 |  __truediv__(self, value, /)
 |      Return self/value.
 |
 |  __trunc__(...)
 |      Truncating an Integral returns itself.
 |
 |  __xor__(self, value, /)
 |      Return self^value.
 |
 |  as_integer_ratio(self, /)
 |      Return integer ratio.
 |
 |      Return a pair of integers, whose ratio is exactly equal to the original int
 |      and with a positive denominator.
 |
 |      >>> (10).as_integer_ratio()
 |      (10, 1)
 |      >>> (-10).as_integer_ratio()
 |      (-10, 1)
 |      >>> (0).as_integer_ratio()
 |      (0, 1)
 |
 |  bit_length(self, /)
 |      Number of bits necessary to represent self in binary.
 |
 |      >>> bin(37)
 |      '0b100101'
 |      >>> (37).bit_length()
 |      6
 |
 |  conjugate(...)
 |      Returns self, the complex conjugate of any int.
 |
 |  to_bytes(self, /, length, byteorder, *, signed=False)
 |      Return an array of bytes representing an integer.
 |
 |      length
 |        Length of bytes object to use.  An OverflowError is raised if the
 |        integer is not representable with the given number of bytes.
 |      byteorder
 |        The byte order used to represent the integer.  If byteorder is 'big',
 |        the most significant byte is at the beginning of the byte array.  If
 |        byteorder is 'little', the most significant byte is at the end of the
 |        byte array.  To request the native byte order of the host system, use
 |        `sys.byteorder' as the byte order value.
 |      signed
 |        Determines whether two's complement is used to represent the integer.
 |        If signed is False and a negative integer is given, an OverflowError
 |        is raised.
 |
 |  ----------------------------------------------------------------------
 |  Class methods defined here:
 |
 |  from_bytes(bytes, byteorder, *, signed=False) from builtins.type
 |      Return the integer represented by the given array of bytes.
 |
 |      bytes
 |        Holds the array of bytes to convert.  The argument must either
 |        support the buffer protocol or be an iterable object producing bytes.
 |        Bytes and bytearray are examples of built-in objects that support the
 |        buffer protocol.
 |      byteorder
 |        The byte order used to represent the integer.  If byteorder is 'big',
 |        the most significant byte is at the beginning of the byte array.  If
 |        byteorder is 'little', the most significant byte is at the end of the
 |        byte array.  To request the native byte order of the host system, use
 |        `sys.byteorder' as the byte order value.
 |      signed
 |        Indicates whether two's complement is used to represent the integer.
 |
 |  ----------------------------------------------------------------------
 |  Static methods defined here:
 |
 |  __new__(*args, **kwargs) from builtins.type
 |      Create and return a new object.  See help(type) for accurate signature.
 |
 |  ----------------------------------------------------------------------
 |  Data descriptors defined here:
 |
 |  denominator
 |      the denominator of a rational number in lowest terms
 |
 |  imag
 |      the imaginary part of a complex number
 |
 |  numerator
 |      the numerator of a rational number in lowest terms
 |
 |  real
 |      the real part of a complex number

None

In [224]:
print(df2)

       year  name  points  penalty  debt  net_points  high_points
one    2013  John     2.5      0.5   NaN         2.0         True
two    2017  Jane     3.2      0.5  -1.3         2.7         True
three  2015   Tom     2.4      0.5   NaN         1.9         True
four   2016  Rick     7.1      0.5  -2.2         6.6         True
five   2015  Sara     1.1      0.5  -0.9         0.6        False

In [226]:
df2.shape

(5, 7)

In [228]:
s1 = pd.Series(np.random.randint(0,10,5), index = ['a','b','c','d','e'])

In [229]:
s1

a    4
b    7
c    4
d    3
e    7
dtype: int64

In [230]:
s2 = pd.Series(np.random.randint(0,10,5), index = ['c','d','e','f','g'])

In [231]:
s2

c    3
d    5
e    1
f    1
g    1
dtype: int64

In [235]:
s3 = (s1 + s2) # dtype = int64)

In [236]:
s3

a    NaN
b    NaN
c    7.0
d    8.0
e    8.0
f    NaN
g    NaN
dtype: float64

In [237]:
s4 = s1 - s2

In [238]:
s4

a    NaN
b    NaN
c    1.0
d   -2.0
e    6.0
f    NaN
g    NaN
dtype: float64

In [240]:
s5 = s1 ** s2

In [241]:
s5 # how to add as int64 ?

a      NaN
b      NaN
c     64.0
d    243.0
e      7.0
f      NaN
g      NaN
dtype: float64

In [245]:
df1 = pd.DataFrame(np.random.randint(0,10,12).reshape(3,4),
                   columns = ['a','b','c','d'], 
                   index = ['one', 'two', 'three'])

In [246]:
df1

       a  b  c  d
one    2  4  7  5
two    2  7  2  8
three  1  2  6  0

In [247]:
df2 = pd.DataFrame(np.random.randint(0,10,12).reshape(4,3),
                   columns=['c','d','e'], 
                   index = ['two', 'three', 'four','five']
                  )

In [248]:
df2

       c  d  e
two    8  9  1
three  5  2  4
four   5  4  6
five   0  8  8

In [249]:
df1 + df2

        a   b     c     d   e
five  NaN NaN   NaN   NaN NaN
four  NaN NaN   NaN   NaN NaN
one   NaN NaN   NaN   NaN NaN
three NaN NaN  11.0   2.0 NaN
two   NaN NaN  10.0  17.0 NaN

In [251]:
df4 = pd.DataFrame(np.random.randint(0,10,12).reshape(4,3),
                   columns=['c','d','e'], 
                   index = ['two', 'three', 'four','five']
                  )

In [252]:
df5 = pd.DataFrame(np.random.randint(0,10,12).reshape(4,3),
                   columns=['c','d','e'], 
                   index = ['two', 'three', 'four','five']
                  )

In [254]:
df6 = df5 + df4

In [256]:
print(dir(df6))

['T', '_AXIS_LEN', '_AXIS_ORDERS', '_AXIS_REVERSED', '_AXIS_TO_AXIS_NUMBER', '_HANDLED_TYPES', '__abs__', '__add__', '__and__', '__annotations__', '__array__', '__array_priority__', '__array_ufunc__', '__array_wrap__', '__bool__', '__class__', '__contains__', '__copy__', '__deepcopy__', '__delattr__', '__delitem__', '__dict__', '__dir__', '__divmod__', '__doc__', '__eq__', '__finalize__', '__floordiv__', '__format__', '__ge__', '__getattr__', '__getattribute__', '__getitem__', '__getstate__', '__gt__', '__hash__', '__iadd__', '__iand__', '__ifloordiv__', '__imod__', '__imul__', '__init__', '__init_subclass__', '__invert__', '__ior__', '__ipow__', '__isub__', '__iter__', '__itruediv__', '__ixor__', '__le__', '__len__', '__lt__', '__matmul__', '__mod__', '__module__', '__mul__', '__ne__', '__neg__', '__new__', '__nonzero__', '__or__', '__pos__', '__pow__', '__radd__', '__rand__', '__rdivmod__', '__reduce__', '__reduce_ex__', '__repr__', '__rfloordiv__', '__rmatmul__', '__rmod__', '__rmul__', '__ror__', '__round__', '__rpow__', '__rsub__', '__rtruediv__', '__rxor__', '__setattr__', '__setitem__', '__setstate__', '__sizeof__', '__str__', '__sub__', '__subclasshook__', '__truediv__', '__weakref__', '__xor__', '_accessors', '_accum_func', '_add_numeric_operations', '_agg_by_level', '_agg_examples_doc', '_agg_summary_and_see_also_doc', '_align_frame', '_align_series', '_arith_method', '_as_manager', '_attrs', '_box_col_values', '_can_fast_transpose', '_check_inplace_and_allows_duplicate_labels', '_check_inplace_setting', '_check_is_chained_assignment_possible', '_check_label_or_level_ambiguity', '_check_setitem_copy', '_clear_item_cache', '_clip_with_one_bound', '_clip_with_scalar', '_cmp_method', '_combine_frame', '_consolidate', '_consolidate_inplace', '_construct_axes_dict', '_construct_axes_from_arguments', '_construct_result', '_constructor', '_constructor_sliced', '_convert', '_count_level', '_data', '_dir_additions', '_dir_deletions', '_dispatch_frame_op', '_drop_axis', '_drop_labels_or_levels', '_ensure_valid_index', '_find_valid_index', '_flags', '_from_arrays', '_from_mgr', '_get_agg_axis', '_get_axis', '_get_axis_name', '_get_axis_number', '_get_axis_resolvers', '_get_block_manager_axis', '_get_bool_data', '_get_cleaned_column_resolvers', '_get_column_array', '_get_index_resolvers', '_get_item_cache', '_get_label_or_level_values', '_get_numeric_data', '_get_value', '_getitem_bool_array', '_getitem_multilevel', '_gotitem', '_hidden_attrs', '_indexed_same', '_info_axis', '_info_axis_name', '_info_axis_number', '_info_repr', '_init_mgr', '_inplace_method', '_internal_names', '_internal_names_set', '_is_copy', '_is_homogeneous_type', '_is_label_or_level_reference', '_is_label_reference', '_is_level_reference', '_is_mixed_type', '_is_view', '_iset_item', '_iset_item_mgr', '_iset_not_inplace', '_item_cache', '_iter_column_arrays', '_ixs', '_join_compat', '_logical_func', '_logical_method', '_maybe_cache_changed', '_maybe_update_cacher', '_metadata', '_mgr', '_min_count_stat_function', '_needs_reindex_multi', '_protect_consolidate', '_reduce', '_reindex_axes', '_reindex_columns', '_reindex_index', '_reindex_multi', '_reindex_with_indexers', '_replace_columnwise', '_repr_data_resource_', '_repr_fits_horizontal_', '_repr_fits_vertical_', '_repr_html_', '_repr_latex_', '_reset_cache', '_reset_cacher', '_sanitize_column', '_series', '_set_axis', '_set_axis_name', '_set_axis_nocheck', '_set_is_copy', '_set_item', '_set_item_frame_value', '_set_item_mgr', '_set_value', '_setitem_array', '_setitem_frame', '_setitem_slice', '_slice', '_stat_axis', '_stat_axis_name', '_stat_axis_number', '_stat_function', '_stat_function_ddof', '_take_with_is_copy', '_to_dict_of_blocks', '_typ', '_update_inplace', '_validate_dtype', '_values', '_where', 'abs', 'add', 'add_prefix', 'add_suffix', 'agg', 'aggregate', 'align', 'all', 'any', 'append', 'apply', 'applymap', 'asfreq', 'asof', 'assign', 'astype', 'at', 'at_time', 'attrs', 'axes', 'backfill', 'between_time', 'bfill', 'bool', 'boxplot', 'c', 'clip', 'columns', 'combine', 'combine_first', 'compare', 'convert_dtypes', 'copy', 'corr', 'corrwith', 'count', 'cov', 'cummax', 'cummin', 'cumprod', 'cumsum', 'd', 'describe', 'diff', 'div', 'divide', 'dot', 'drop', 'drop_duplicates', 'droplevel', 'dropna', 'dtypes', 'duplicated', 'e', 'empty', 'eq', 'equals', 'eval', 'ewm', 'expanding', 'explode', 'ffill', 'fillna', 'filter', 'first', 'first_valid_index', 'flags', 'floordiv', 'from_dict', 'from_records', 'ge', 'get', 'groupby', 'gt', 'head', 'hist', 'iat', 'idxmax', 'idxmin', 'iloc', 'index', 'infer_objects', 'info', 'insert', 'interpolate', 'isin', 'isna', 'isnull', 'items', 'iteritems', 'iterrows', 'itertuples', 'join', 'keys', 'kurt', 'kurtosis', 'last', 'last_valid_index', 'le', 'loc', 'lookup', 'lt', 'mad', 'mask', 'max', 'mean', 'median', 'melt', 'memory_usage', 'merge', 'min', 'mod', 'mode', 'mul', 'multiply', 'ndim', 'ne', 'nlargest', 'notna', 'notnull', 'nsmallest', 'nunique', 'pad', 'pct_change', 'pipe', 'pivot', 'pivot_table', 'plot', 'pop', 'pow', 'prod', 'product', 'quantile', 'query', 'radd', 'rank', 'rdiv', 'reindex', 'reindex_like', 'rename', 'rename_axis', 'reorder_levels', 'replace', 'resample', 'reset_index', 'rfloordiv', 'rmod', 'rmul', 'rolling', 'round', 'rpow', 'rsub', 'rtruediv', 'sample', 'select_dtypes', 'sem', 'set_axis', 'set_flags', 'set_index', 'shape', 'shift', 'size', 'skew', 'slice_shift', 'sort_index', 'sort_values', 'squeeze', 'stack', 'std', 'style', 'sub', 'subtract', 'sum', 'swapaxes', 'swaplevel', 'tail', 'take', 'to_clipboard', 'to_csv', 'to_dict', 'to_excel', 'to_feather', 'to_gbq', 'to_hdf', 'to_html', 'to_json', 'to_latex', 'to_markdown', 'to_numpy', 'to_parquet', 'to_period', 'to_pickle', 'to_records', 'to_sql', 'to_stata', 'to_string', 'to_timestamp', 'to_xarray', 'to_xml', 'transform', 'transpose', 'truediv', 'truncate', 'tz_convert', 'tz_localize', 'unstack', 'update', 'value_counts', 'values', 'var', 'where', 'xs']

In [257]:
print(df6.info)

<bound method DataFrame.info of         c   d   e
two    15   7   4
three  15   8  10
four    6  16  14
five    9  10   7>

In [258]:
df6.dtypes

c    int64
d    int64
e    int64
dtype: object

In [259]:
df1.add(df2, fill_value = 0.0)

         a    b     c     d    e
five   NaN  NaN   0.0   8.0  8.0
four   NaN  NaN   5.0   4.0  6.0
one    2.0  4.0   7.0   5.0  NaN
three  1.0  2.0  11.0   2.0  4.0
two    2.0  7.0  10.0  17.0  1.0

In [260]:
df1

       a  b  c  d
one    2  4  7  5
two    2  7  2  8
three  1  2  6  0

In [261]:
1/df1

         a         b         c      d
one    0.5  0.250000  0.142857  0.200
two    0.5  0.142857  0.500000  0.125
three  1.0  0.500000  0.166667    inf

In [262]:
df1.rdiv(1)

         a         b         c      d
one    0.5  0.250000  0.142857  0.200
two    0.5  0.142857  0.500000  0.125
three  1.0  0.500000  0.166667    inf

In [264]:
df1.pow(2)

       a   b   c   d
one    4  16  49  25
two    4  49   4  64
three  1   4  36   0

In [265]:
df1 ** 2

       a   b   c   d
one    4  16  49  25
two    4  49   4  64
three  1   4  36   0

In [267]:
df2

       c  d  e
two    8  9  1
three  5  2  4
four   5  4  6
five   0  8  8

In [266]:
df2.floordiv(2) # // 2

       c  d  e
two    4  4  0
three  2  1  2
four   2  2  3
five   0  4  4

In [268]:
df2 // 2

       c  d  e
two    4  4  0
three  2  1  2
four   2  2  3
five   0  4  4

In [269]:
df1 - s1

       a  b  c  d   e
one   -2 -3  3  2 NaN
two   -2  0 -2  5 NaN
three -3 -5  2 -3 NaN

In [293]:
df1.sub(df2, fill_value = 0)

         a    b    c    d    e
five   NaN  NaN  0.0 -8.0 -8.0
four   NaN  NaN -5.0 -4.0 -6.0
one    2.0  4.0  7.0  5.0  NaN
three  1.0  2.0  1.0 -2.0 -4.0
two    2.0  7.0 -6.0 -1.0 -1.0

In [271]:
print(df1)

       a  b  c  d
one    2  4  7  5
two    2  7  2  8
three  1  2  6  0

In [272]:
print(s1)

a    4
b    7
c    4
d    3
e    7
dtype: int64

In [276]:
s3 = pd.Series([1,2,3], index = ['one', 'two', 'three'])

In [277]:
s3

one      1
two      2
three    3
dtype: int64

In [287]:
df1.sub(s3, axis=0)

       a  b  c  d
one    1  3  6  4
two    0  5  0  6
three -2 -1  3 -3

In [279]:
df1

       a  b  c  d
one    2  4  7  5
two    2  7  2  8
three  1  2  6  0

In [ ]:
# row operations

In [282]:
df1.T

   one  two  three
a    2    2      1
b    4    7      2
c    7    2      6
d    5    8      0

In [283]:
df1.T - s3

   one  two  three
a    1    0     -2
b    3    5     -1
c    6    0      3
d    4    6     -3

In [284]:
s3

one      1
two      2
three    3
dtype: int64

In [285]:
(df1.T - s3).T

       a  b  c  d
one    1  3  6  4
two    0  5  0  6
three -2 -1  3 -3

In [286]:
df1.sub(s3, axis=0) # column => axis = 1

       a  b  c  d
one    1  3  6  4
two    0  5  0  6
three -2 -1  3 -3

In [295]:
df1.sub(s3,axis='index')

       a  b  c  d
one    1  3  6  4
two    0  5  0  6
three -2 -1  3 -3

In [297]:
print(df1.index, s3.index
     )

Index(['one', 'two', 'three'], dtype='object') Index(['one', 'two', 'three'], dtype='object')

In [299]:
df1

       a  b  c  d
one    2  4  7  5
two    2  7  2  8
three  1  2  6  0

In [300]:
s3

one      1
two      2
three    3
dtype: int64